Kom46/MFRC522_STM32/MFRC522.cpp
/*
 * MFRC522.cpp - Library to use ARDUINO RFID MODULE KIT 13.56 MHZ WITH TAGS SPI W AND R BY COOQROBOT.
 * NOTE: Please also check the comments in MFRC522.h - they provide useful hints and background information.
 * Released into the public domain.
 */
#if defined __ARDUINO__
#include <Arduino.h>
#elif defined __STM32__
#if defined STM32F407xx
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_spi.h"
#elif (defined STM32F767xx) || (defined STM32F746xx)
#include "stm32f7xx_hal.h"
#include "stm32f7xx_hal_spi.h"
#endif
#include "main.h"
#include <string.h>
#ifndef RC522_SPI_HANDLE_POINTER
#error "Define spi handle pointer for your RC522 in main.h in format #define RC522_SPI_HANDLE_POINtER <(&your_spi_handle)>"
#endif
#endif
#include "MFRC522.h"
//#include <cstring>
/////////////////////////////////////////////////////////////////////////////////////
// Functions for setting up the Arduino
/////////////////////////////////////////////////////////////////////////////////////
#if defined __ARDUINO__
/**
 * Constructor.
 */
MFRC522::MFRC522() :
		MFRC522(SS, UINT8_MAX)
{ // SS is defined in pins_arduino.h, UINT8_MAX means there is no connection from Arduino to MFRC522's reset and power down input
} // End constructor

/**
 * Constructor.
 * Prepares the output pins.
 */
MFRC522::MFRC522( byte resetPowerDownPin///< Arduino pin connected to MFRC522's reset and power down input (Pin 6, NRSTPD, active low). If there is no connection from the CPU to NRSTPD, set this to UINT8_MAX. In this case, only soft reset will be used in PCD_Init().
		) :
		MFRC522(SS, resetPowerDownPin)
{ // SS is defined in pins_arduino.h
} // End constructor
/**
 * Constructor.
 * Prepares the output pins.
 */
MFRC522::MFRC522( byte chipSelectPin,///< Arduino pin connected to MFRC522's SPI slave select input (Pin 24, NSS, active low)
		byte resetPowerDownPin///< Arduino pin connected to MFRC522's reset and power down input (Pin 6, NRSTPD, active low). If there is no connection from the CPU to NRSTPD, set this to UINT8_MAX. In this case, only soft reset will be used in PCD_Init().
		)
{
	_chipSelectPin = chipSelectPin;
	_resetPowerDownPin = resetPowerDownPin;
} // End constructor
#elif defined __STM32__
MFRC522::MFRC522() :
		MFRC522(RC522_nCS_GPIO_Port, RC522_nCS_Pin, RC522_nRST_GPIO_Port,
		RC522_nRST_Pin)
{
}
;
MFRC522::MFRC522(GPIO_TypeDef *nRST_Port, uint32_t nRST_Pin) :
		MFRC522(RC522_nCS_GPIO_Port, RC522_nCS_Pin, nRST_Port, nRST_Pin)
{
}
;
MFRC522::MFRC522(GPIO_TypeDef *nCS_Port, uint32_t nCS_Pin,
		GPIO_TypeDef *nRST_Port, uint32_t nRST_Pin)
{
	_nCS_Port = nCS_Port;
	_nCS_Pin = nCS_Pin;
	_nRST_Port = nRST_Port;
	_nRST_Pin = nRST_Pin;
}
#endif
/////////////////////////////////////////////////////////////////////////////////////
// Basic interface functions for communicating with the MFRC522
/////////////////////////////////////////////////////////////////////////////////////

/**
 * Writes a byte to the specified register in the MFRC522 chip.
 * The interface is described in the datasheet section 8.1.2.
 */
void MFRC522::PCD_WriteRegister(PCD_Register reg, ///< The register to write to. One of the PCD_Register enums.
		byte value			///< The value to write.
		)
{
#if defined __ARDUINO__
	SPI.beginTransaction(SPISettings(MFRC522_SPICLOCK, MSBFIRST, SPI_MODE0));	// Set the settings to work with SPI bus
	digitalWrite(_chipSelectPin, LOW);		// Select slave
	SPI.transfer(reg);						// MSB == 0 is for writing. LSB is not used in address. Datasheet section 8.1.2.3.
	SPI.transfer(value);
	digitalWrite(_chipSelectPin, HIGH);		// Release slave again
	SPI.endTransaction(); // Stop using the SPI bus
#elif defined __STM32__
//	HAL_Delay(1);
	HAL_GPIO_WritePin(_nCS_Port, (uint16_t) _nCS_Pin, GPIO_PIN_RESET);
	uint8_t buff[2] =
	{ reg, value };
	HAL_SPI_Transmit(RC522_SPI_HANDLE_POINTER, buff, 2, 50);
//#if (DEBUG == 1)
//	uint8_t val = PCD_ReadRegister(reg);
//#endif
	HAL_GPIO_WritePin(_nCS_Port, _nCS_Pin, GPIO_PIN_SET);
//	HAL_Delay(1);
#endif
} // End PCD_WriteRegister()

/**
 * Writes a number of bytes to the specified register in the MFRC522 chip.
 * The interface is described in the datasheet section 8.1.2.
 */
void MFRC522::PCD_WriteRegister(PCD_Register reg, ///< The register to write to. One of the PCD_Register enums.
		byte count,			///< The number of bytes to write to the register
		byte *values		///< The values to write. Byte array.
		)
{
#if defined __ARDUINO__
	SPI.beginTransaction(SPISettings(MFRC522_SPICLOCK, MSBFIRST, SPI_MODE0));// Set the settings to work with SPI bus
	digitalWrite(_chipSelectPin, LOW);		// Select slave
	SPI.transfer(reg);// MSB == 0 is for writing. LSB is not used in address. Datasheet section 8.1.2.3.
	for (byte index = 0; index < count; index++)
	{
		SPI.transfer(values[index]);
	}
	digitalWrite(_chipSelectPin, HIGH);		// Release slave again
	SPI.endTransaction(); // Stop using the SPI bus
#elif defined __STM32__
//	HAL_Delay(1);
	HAL_GPIO_WritePin(_nCS_Port, (uint16_t) _nCS_Pin, GPIO_PIN_RESET);
	uint8_t * buff = new uint8_t[count + 1];
	buff[0] = reg;
	memcpy(&buff[1], values, count);
	HAL_SPI_Transmit(RC522_SPI_HANDLE_POINTER, buff, count + 1, 500);
	delete[] buff;
	HAL_GPIO_WritePin(_nCS_Port, _nCS_Pin, GPIO_PIN_SET);
//	HAL_Delay(1);
#endif
} // End PCD_WriteRegister()

/**
 * Reads a byte from the specified register in the MFRC522 chip.
 * The interface is described in the datasheet section 8.1.2.
 */
byte MFRC522::PCD_ReadRegister(PCD_Register reg	///< The register to read from. One of the PCD_Register enums.
		)
{
	byte value;
#if defined __ARDUINO__
	SPI.beginTransaction(SPISettings(MFRC522_SPICLOCK, MSBFIRST, SPI_MODE0));// Set the settings to work with SPI bus
	digitalWrite(_chipSelectPin, LOW);			// Select slave
	SPI.transfer(0x80 | reg);// MSB == 1 is for reading. LSB is not used in address. Datasheet section 8.1.2.3.
	value = SPI.transfer(0);	// Read the value back. Send 0 to stop reading.
	digitalWrite(_chipSelectPin, HIGH);			// Release slave again
	SPI.endTransaction(); // Stop using the SPI bus
#elif defined __STM32__
//	HAL_Delay(1);
	HAL_GPIO_WritePin(_nCS_Port, (uint16_t) _nCS_Pin, GPIO_PIN_RESET);
//	HAL_SPI_Receive_DMA(RC522_SPI_HANDLE_POINTER, &value, 1);
	uint8_t address = reg | 0x80;
//	address |= reg;
	uint8_t tx_buff[2] =
	{ address, 0 };
	uint8_t rx_buff[2] =
	{ 0 };
//	HAL_SPI_Transmit(RC522_SPI_HANDLE_POINTER, &address, 1, 500);
//	uint8_t zero = 0;
//	HAL_SPI_Receive_DMA(RC522_SPI_HANDLE_POINTER, &value, 1);
//	HAL_SPI_TransmitReceive_DMA(RC522_SPI_HANDLE_POINTER, &zero, &value, 1);
//	extern bool spi_receive_is_end;
//	HAL_SPI_Transmit(RC522_SPI_HANDLE_POINTER, &zero, 1, 500);
//	HAL_Delay(1);
	HAL_SPI_TransmitReceive(RC522_SPI_HANDLE_POINTER, tx_buff, rx_buff, 2, 500);
	HAL_GPIO_WritePin(_nCS_Port, _nCS_Pin, GPIO_PIN_SET);
//	HAL_Delay(1);
#endif
	return rx_buff[1];
} // End PCD_ReadRegister()

/**
 * Reads a number of bytes from the specified register in the MFRC522 chip.
 * The interface is described in the datasheet section 8.1.2.
 */
void MFRC522::PCD_ReadRegister(PCD_Register reg, ///< The register to read from. One of the PCD_Register enums.
		byte count,			///< The number of bytes to read
		byte *values,		///< Byte array to store the values in.
		byte rxAlign///< Only bit positions rxAlign..7 in values[0] are updated.
		)
{
	if (count == 0)
	{
		return;
	}
	//Serial.print(F("Reading ")); 	Serial.print(count); Serial.println(F(" bytes from register."));
	byte address = 0x80 | reg;// MSB == 1 is for reading. LSB is not used in address. Datasheet section 8.1.2.3.
	byte index = 0;							// Index in values array.
#if defined __ARDUINO__
	SPI.beginTransaction(SPISettings(MFRC522_SPICLOCK, MSBFIRST, SPI_MODE0));// Set the settings to work with SPI bus
	digitalWrite(_chipSelectPin, LOW);		// Select slave
	count--;						// One read is performed outside of the loop
#elif defined __STM32__
//	HAL_Delay(1);
	HAL_GPIO_WritePin(_nCS_Port, _nCS_Pin, GPIO_PIN_RESET);
//	HAL_Delay(1);
	uint8_t *tx_buff = new uint8_t[count + 1];
	uint8_t *rx_buff = new uint8_t[count + 1];
	memset(tx_buff, address, count);
	tx_buff[count] = 0;
	memset(rx_buff, 0, count);
	HAL_SPI_TransmitReceive(RC522_SPI_HANDLE_POINTER, tx_buff, rx_buff,
			count + 1, 500);
#endif
#if defined __ARDUINO__
	SPI.transfer(address);		// Tell MFRC522 which address we want to read
#elif defined __STM32__
//	HAL_SPI_Transmit(RC522_SPI_HANDLE_POINTER, &address, 1, 500);
#endif
	if (rxAlign)
	{		// Only update bit positions rxAlign..7 in values[0]
		// Create bit mask for bit positions rxAlign..7
#if defined __ARDUINO__
		// Read value and tell that we want to read the same address again.
		byte mask = (0xFF << rxAlign) & 0xFF;
		byte value = SPI.transfer(address);
		// Apply mask to both current value of values[0] and the new data in value.
			values[0] = (values[0] & ~mask) | (value & mask);
			index++;
#elif defined __STM32__
//		byte value = rx_buff[1];
//		uint8_t tx_buff[2] = {address, address};
//		uint8_t rx_buff[2] = {0};
//		HAL_SPI_TransmitReceive(RC522_SPI_HANDLE_POINTER, tx_buff, rx_buff, 2,
//				500);
//		byte value = rx_buff[1];
#endif
	}
	while (index < count)
	{
#if defined __ARDUINO__
		values[index] = SPI.transfer(address);// Read value and tell that we want to read the same address again.
#elif defined __STM32__
//		uint8_t tx_buff[count] = {0};
//		uint8_t rx_buff[count] = {0};
//		uint8_t *tx_buff = new uint8_t[count];
//		uint8_t * rx_buff = new uint8_t[count];
//		memset(tx_buff, address, count - 1);
//		HAL_SPI_TransmitReceive(RC522_SPI_HANDLE_POINTER, tx_buff,
//				rx_buff, count, 500);
//		memcpy(&values[1], rx_buff, count);
//		delete[] tx_buff;
//		delete[] rx_buff;
		index = count;
		break;
#endif
		index++;
	}
#if defined __ARDUINO__
	values[index] = SPI.transfer(0);// Read the final byte. Send 0 to stop reading.
	digitalWrite(_chipSelectPin, HIGH);			// Release slave again
	SPI.endTransaction(); // Stop using the SPI bus
#elif defined __STM32__
//	uint8_t zero = 0;
//	uint8_t tx_buff[2] = {0};
//	uint8_t rx_buff[2] = {0};
//	HAL_SPI_TransmitReceive(RC522_SPI_HANDLE_POINTER, tx_buff, rx_buff, 1,
//			500);
//	values[index] = rx_buff[1];
	int start = 0;
	if (rxAlign)
	{
		byte mask = (0xFF << rxAlign) & 0xFF;
		values[0] = (values[0] & ~mask) | (rx_buff[1] & mask);
		start++;
	}
	memcpy(&values[start], &rx_buff[start + 1], count - start);
	HAL_GPIO_WritePin(_nCS_Port, _nCS_Pin, GPIO_PIN_SET);
#endif
} // End PCD_ReadRegister()

/**
 * Sets the bits given in mask in register reg.
 */
void MFRC522::PCD_SetRegisterBitMask(PCD_Register reg, ///< The register to update. One of the PCD_Register enums.
		byte mask			///< The bits to set.
		)
{
	byte tmp;
	tmp = PCD_ReadRegister(reg);
	PCD_WriteRegister(reg, tmp | mask);			// set bit mask
} // End PCD_SetRegisterBitMask()

/**
 * Clears the bits given in mask from register reg.
 */
void MFRC522::PCD_ClearRegisterBitMask(PCD_Register reg, ///< The register to update. One of the PCD_Register enums.
		byte mask			///< The bits to clear.
		)
{
	byte tmp;
	tmp = PCD_ReadRegister(reg);
	PCD_WriteRegister(reg, tmp & (~mask));		// clear bit mask
} // End PCD_ClearRegisterBitMask()

/**
 * Use the CRC coprocessor in the MFRC522 to calculate a CRC_A.
 * 
 * @return STATUS_OK on success, STATUS_??? otherwise.
 */
MFRC522::StatusCode MFRC522::PCD_CalculateCRC( byte *data, ///< In: Pointer to the data to transfer to the FIFO for CRC calculation.
		byte length,	///< In: The number of bytes to transfer.
		byte *result///< Out: Pointer to result buffer. Result is written to result[0..1], low byte first.
		)
{
	PCD_WriteRegister(CommandReg, PCD_Idle);		// Stop any active command.
	PCD_WriteRegister(DivIrqReg, 0x04);	// Clear the CRCIRq interrupt request bit
	PCD_WriteRegister(FIFOLevelReg, 0x80);// FlushBuffer = 1, FIFO initialization
	PCD_WriteRegister(FIFODataReg, length, data);	// Write data to the FIFO
	PCD_WriteRegister(CommandReg, PCD_CalcCRC);		// Start the calculation

	// Wait for the CRC calculation to complete. Each iteration of the while-loop takes 17.73μs.
	// TODO check/modify for other architectures than Arduino Uno 16bit

	// Wait for the CRC calculation to complete. Each iteration of the while-loop takes 17.73us.
	for (uint16_t i = 5000; i > 0; i--)
	{
		// DivIrqReg[7..0] bits are: Set2 reserved reserved MfinActIRq reserved CRCIRq reserved reserved
		byte n = PCD_ReadRegister(DivIrqReg);
		if (n & 0x04)
		{									// CRCIRq bit set - calculation done
			PCD_WriteRegister(CommandReg, PCD_Idle);// Stop calculating CRC for new content in the FIFO.
			// Transfer the result from the registers to the result buffer
			result[0] = PCD_ReadRegister(CRCResultRegL);
			result[1] = PCD_ReadRegister(CRCResultRegH);
			return STATUS_OK;
		}
	}
	// 89ms passed and nothing happend. Communication with the MFRC522 might be down.
	return STATUS_TIMEOUT;
} // End PCD_CalculateCRC()

/////////////////////////////////////////////////////////////////////////////////////
// Functions for manipulating the MFRC522
/////////////////////////////////////////////////////////////////////////////////////

/**
 * Initializes the MFRC522 chip.
 */
void MFRC522::PCD_Init()
{
	bool hardReset = false;
#if defined __ARDUINO__
	// Set the chipSelectPin as digital output, do not select the slave yet
	pinMode(_chipSelectPin, OUTPUT);
	digitalWrite(_chipSelectPin, HIGH);

