Kom46/MFRC522_STM32/MFRC522.cpp
	// If a valid pin number has been set, pull device out of power down / reset state.
	if (_resetPowerDownPin != UNUSED_PIN)
	{
		// First set the resetPowerDownPin as digital input, to check the MFRC522 power down mode.
		pinMode(_resetPowerDownPin, INPUT);

		if (digitalRead(_resetPowerDownPin) == LOW)
		{	// The MFRC522 chip is in power down mode.
			pinMode(_resetPowerDownPin, OUTPUT);// Now set the resetPowerDownPin as digital output.
			digitalWrite(_resetPowerDownPin, LOW);// Make sure we have a clean LOW state.
			delayMicroseconds(2);// 8.8.1 Reset timing requirements says about 100ns. Let us be generous: 2μsl
			digitalWrite(_resetPowerDownPin, HIGH);	// Exit power down mode. This triggers a hard reset.
			// Section 8.8.2 in the datasheet says the oscillator start-up time is the start up time of the crystal + 37,74μs. Let us be generous: 50ms.
			delay(50);
			hardReset = true;
		}
	}
#elif defined __STM32__
	HAL_GPIO_WritePin(_nRST_Port, _nRST_Pin, GPIO_PIN_SET);
	HAL_Delay(1);
	HAL_GPIO_WritePin(_nRST_Port, _nRST_Pin, GPIO_PIN_RESET);
	HAL_Delay(1);
	HAL_GPIO_WritePin(_nRST_Port, _nRST_Pin, GPIO_PIN_SET);
#endif

	if (!hardReset)
	{ // Perform a soft reset if we haven't triggered a hard reset above.
		PCD_Reset();
	}

	// Reset baud rates
	PCD_WriteRegister(TxModeReg, 0x00);
	PCD_WriteRegister(RxModeReg, 0x00);
	// Reset ModWidthReg
	PCD_WriteRegister(ModWidthReg, 0x26);

	// When communicating with a PICC we need a timeout if something goes wrong.
	// f_timer = 13.56 MHz / (2*TPreScaler+1) where TPreScaler = [TPrescaler_Hi:TPrescaler_Lo].
	// TPrescaler_Hi are the four low bits in TModeReg. TPrescaler_Lo is TPrescalerReg.
	PCD_WriteRegister(TModeReg, 0x80);// TAuto=1; timer starts automatically at the end of the transmission in all communication modes at all speeds
	PCD_WriteRegister(TPrescalerReg, 0xA9);	// TPreScaler = TModeReg[3..0]:TPrescalerReg, ie 0x0A9 = 169 => f_timer=40kHz, ie a timer period of 25μs.
	PCD_WriteRegister(TReloadRegH, 0x03);// Reload timer with 0x3E8 = 1000, ie 25ms before timeout.
	PCD_WriteRegister(TReloadRegL, 0xE8);

	PCD_WriteRegister(TxASKReg, 0x40);// Default 0x00. Force a 100 % ASK modulation independent of the ModGsPReg register setting
	PCD_WriteRegister(ModeReg, 0x3D);// Default 0x3F. Set the preset value for the CRC coprocessor for the CalcCRC command to 0x6363 (ISO 14443-3 part 6.2.4)
	PCD_AntennaOn();// Enable the antenna driver pins TX1 and TX2 (they were disabled by the reset)
} // End PCD_Init()

/**
 * Initializes the MFRC522 chip.
 */
void MFRC522::PCD_Init(
#if defined __ARDUINO__
		byte resetPowerDownPin ///< Arduino pin connected to MFRC522's reset and power down input (Pin 6, NRSTPD, active low)
#elif defined __STM32__
		GPIO_TypeDef *nRST_Port, uint32_t nRST_Pin
#endif
		)
{
#if defined __ARDUINO__
	PCD_Init(SS, resetPowerDownPin); // SS is defined in pins_arduino.h
#elif defined __STM32__
	PCD_Init(RC522_nCS_GPIO_Port, RC522_nCS_Pin, nRST_Port, nRST_Pin);
#endif
} // End PCD_Init()

/**
 * Initializes the MFRC522 chip.
 */
void MFRC522::PCD_Init(
#if defined __ARDUINO__
		byte chipSelectPin,	///< Arduino pin connected to MFRC522's SPI slave select input (Pin 24, NSS, active low)
		byte resetPowerDownPin///< Arduino pin connected to MFRC522's reset and power down input (Pin 6, NRSTPD, active low)
#elif defined __STM32__
		GPIO_TypeDef *nCS_Port, uint32_t nCS_Pin, GPIO_TypeDef *nRST_Port,
		uint32_t nRST_Pin
#endif
		)
{
#if defined __ARDUINO
	_chipSelectPin = chipSelectPin;
	_resetPowerDownPin = resetPowerDownPin;
#elif defined __STM32__
	_nCS_Port = nCS_Port;
	_nCS_Pin = nCS_Pin;
	_nRST_Port = nRST_Port;
	_nRST_Pin = nRST_Pin;
#endif
	// Set the chipSelectPin as digital output, do not select the slave yet
	PCD_Init();
} // End PCD_Init()

/**
 * Performs a soft reset on the MFRC522 chip and waits for it to be ready again.
 */
void MFRC522::PCD_Reset()
{
	PCD_WriteRegister(CommandReg, PCD_SoftReset); // Issue the SoftReset command.
	// The datasheet does not mention how long the SoftRest command takes to complete.
	// But the MFRC522 might have been in soft power-down mode (triggered by bit 4 of CommandReg) 
	// Section 8.8.2 in the datasheet says the oscillator start-up time is the start up time of the crystal + 37,74μs. Let us be generous: 50ms.
	uint8_t count = 0;
	do
	{
#if defined __ARDUINO__
		// Wait for the PowerDown bit in CommandReg to be cleared (max 3x50ms)
		delay(50);
#elif defined __STM32__
		HAL_Delay(50);
#endif
	} while ((PCD_ReadRegister(CommandReg) & (1 << 4)) && (++count) < 3);
} // End PCD_Reset()

/**
 * Turns the antenna on by enabling pins TX1 and TX2.
 * After a reset these pins are disabled.
 */
void MFRC522::PCD_AntennaOn()
{
	byte value = PCD_ReadRegister(TxControlReg);
	if ((value & 0x03) != 0x03)
	{
		PCD_WriteRegister(TxControlReg, value | 0x03);
	}
} // End PCD_AntennaOn()

/**
 * Turns the antenna off by disabling pins TX1 and TX2.
 */
void MFRC522::PCD_AntennaOff()
{
	PCD_ClearRegisterBitMask(TxControlReg, 0x03);
} // End PCD_AntennaOff()

/**
 * Get the current MFRC522 Receiver Gain (RxGain[2:0]) value.
 * See 9.3.3.6 / table 98 in http://www.nxp.com/documents/data_sheet/MFRC522.pdf
 * NOTE: Return value scrubbed with (0x07<<4)=01110000b as RCFfgReg may use reserved bits.
 * 
 * @return Value of the RxGain, scrubbed to the 3 bits used.
 */
byte MFRC522::PCD_GetAntennaGain()
{
	return PCD_ReadRegister(RFCfgReg) & (0x07 << 4);
} // End PCD_GetAntennaGain()

/**
 * Set the MFRC522 Receiver Gain (RxGain) to value specified by given mask.
 * See 9.3.3.6 / table 98 in http://www.nxp.com/documents/data_sheet/MFRC522.pdf
 * NOTE: Given mask is scrubbed with (0x07<<4)=01110000b as RCFfgReg may use reserved bits.
 */
void MFRC522::PCD_SetAntennaGain(byte mask)
{
	if (PCD_GetAntennaGain() != mask)
	{						// only bother if there is a change
		PCD_ClearRegisterBitMask(RFCfgReg, (0x07 << 4));// clear needed to allow 000 pattern
		PCD_SetRegisterBitMask(RFCfgReg, mask & (0x07 << 4));// only set RxGain[2:0] bits
	}
} // End PCD_SetAntennaGain()

/**
 * Performs a self-test of the MFRC522
 * See 16.1.1 in http://www.nxp.com/documents/data_sheet/MFRC522.pdf
 * 
 * @return Whether or not the test passed. Or false if no firmware reference is available.
 */
bool MFRC522::PCD_PerformSelfTest()
{
	// This follows directly the steps outlined in 16.1.1
	// 1. Perform a soft reset.
	PCD_Reset();

