Kom46/MFRC522_STM32/MFRC522.cpp
	// 2. Clear the internal buffer by writing 25 bytes of 00h
	byte ZEROES[25] =
	{ 0x00 };
	PCD_WriteRegister(FIFOLevelReg, 0x80);		// flush the FIFO buffer
	PCD_WriteRegister(FIFODataReg, 25, ZEROES);	// write 25 bytes of 00h to FIFO
	PCD_WriteRegister(CommandReg, PCD_Mem);		// transfer to internal buffer

	// 3. Enable self-test
	PCD_WriteRegister(AutoTestReg, 0x09);

	// 4. Write 00h to FIFO buffer
	PCD_WriteRegister(FIFODataReg, 0x00);

	// 5. Start self-test by issuing the CalcCRC command
	PCD_WriteRegister(CommandReg, PCD_CalcCRC);

	// 6. Wait for self-test to complete
#if defined __ARDUINO__
	byte n;
	for (uint8_t i = 0; i < 0xFF; i++)
	{
		// The datasheet does not specify exact completion condition except
		// that FIFO buffer should contain 64 bytes.
		// While selftest is initiated by CalcCRC command
		// it behaves differently from normal CRC computation,
		// so one can't reliably use DivIrqReg to check for completion.
		// It is reported that some devices does not trigger CRCIRq flag
		// during selftest.
		n = PCD_ReadRegister(FIFOLevelReg);
		if (n >= 64)
		{
			break;
		}
#if defined __STM32__
//		HAL_Delay(1);
#endif
	}
#elif defined __STM32__
	uint8_t n = 0;
	while (n < 64)
		n = PCD_ReadRegister(FIFOLevelReg);
#endif
	PCD_WriteRegister(CommandReg, PCD_Idle);// Stop calculating CRC for new content in the FIFO.

	// 7. Read out resulting 64 bytes from the FIFO buffer.
	byte result[64];

	PCD_ReadRegister(FIFODataReg, 64, result, 0);

	// Auto self-test done
	// Reset AutoTestReg register to be 0 again. Required for normal operation.
	PCD_WriteRegister(AutoTestReg, 0x00);

	// Determine firmware version (see section 9.3.4.8 in spec)
	byte version = PCD_ReadRegister(VersionReg);

	// Pick the appropriate reference values
	const byte *reference;
	switch (version)
	{
	case 0x88:	// Fudan Semiconductor FM17522 clone
		reference = FM17522_firmware_reference;
		break;
	case 0x90:	// Version 0.0
		reference = MFRC522_firmware_referenceV0_0;
		break;
	case 0x91:	// Version 1.0
		reference = MFRC522_firmware_referenceV1_0;
		break;
	case 0x92:	// Version 2.0
		reference = MFRC522_firmware_referenceV2_0;
		break;
	default:	// Unknown version
		return false; // abort test
	}

	// Verify that the results match up to our expectations
	for (uint8_t i = 0; i < 64; i++)
	{
		if (result[i] !=
#if defined __ARDUINO__
				pgm_read_byte(&(
#endif
				reference[i]
#if defined __ARDUINO__
						  ))
#endif
				)
		{
			return false;
		}
	}

	// Test passed; all is good.
	return true;
} // End PCD_PerformSelfTest()

/////////////////////////////////////////////////////////////////////////////////////
// Power control
/////////////////////////////////////////////////////////////////////////////////////

//IMPORTANT NOTE!!!!
//Calling any other function that uses CommandReg will disable soft power down mode !!!
//For more details about power control, refer to the datasheet - page 33 (8.6)

void MFRC522::PCD_SoftPowerDown()
{ //Note : Only soft power down mode is available throught software
	byte val = PCD_ReadRegister(CommandReg); // Read state of the command register 
	val |= (1 << 4); // set PowerDown bit ( bit 4 ) to 1
	PCD_WriteRegister(CommandReg, val); //write new value to the command register
}

void MFRC522::PCD_SoftPowerUp()
{
	byte val = PCD_ReadRegister(CommandReg); // Read state of the command register 
	val &= ~(1 << 4); // set PowerDown bit ( bit 4 ) to 0
	PCD_WriteRegister(CommandReg, val); //write new value to the command register
	// wait until PowerDown bit is cleared (this indicates end of wake up procedure) 
	uint32_t timeout =
#if defined __ARDUINO__
			(uint32_t) millis() + 500;	// create timer for timeout (just in case)
#elif defined __STM32__
			HAL_GetTick();
	switch (HAL_GetTickFreq())
	{
	case HAL_TICK_FREQ_10HZ:
		timeout += (500 / 100);
		break;
	case HAL_TICK_FREQ_100HZ:
		timeout += (500 / 10);
		break;
	case HAL_TICK_FREQ_1KHZ:
		timeout += 500;
		break;
	}
#endif

	while (
#if defined __ARDUINO__
			millis()
#elif defined __STM32__
	HAL_GetTick()
#endif
			<= timeout)
	{ // set timeout to 500 ms
		val = PCD_ReadRegister(CommandReg); // Read state of the command register
		if (!(val & (1 << 4)))
		{ // if powerdown bit is 0
			break; // wake up procedure is finished
		}
	}
}

/////////////////////////////////////////////////////////////////////////////////////
// Functions for communicating with PICCs
/////////////////////////////////////////////////////////////////////////////////////

/**
 * Executes the Transceive command.
 * CRC validation can only be done if backData and backLen are specified.
 * 
 * @return STATUS_OK on success, STATUS_??? otherwise.
 */
MFRC522::StatusCode MFRC522::PCD_TransceiveData( byte *sendData, ///< Pointer to the data to transfer to the FIFO.
		byte sendLen,		///< Number of bytes to transfer to the FIFO.
		byte *backData,	///< nullptr or pointer to buffer if data should be read back after executing the command.
		byte *backLen,///< In: Max number of bytes to write to *backData. Out: The number of bytes returned.
		byte *validBits,///< In/Out: The number of valid bits in the last byte. 0 for 8 valid bits. Default nullptr.
		byte rxAlign,///< In: Defines the bit position in backData[0] for the first bit received. Default 0.
		bool checkCRC///< In: True => The last two bytes of the response is assumed to be a CRC_A that must be validated.
		)
{
#if defined __ARDUINO__
	byte waitIRq = 0x30;		// RxIRq and IdleIRq
#elif defined __STM32__
	byte waitIRq = RxIRq | IdleIRq;		// RxIRq and IdleIRq
#endif
	return PCD_CommunicateWithPICC(PCD_Transceive, waitIRq, sendData, sendLen,
			backData, backLen, validBits, rxAlign, checkCRC);
} // End PCD_TransceiveData()

/**
 * Transfers data to the MFRC522 FIFO, executes a command, waits for completion and transfers data back from the FIFO.
 * CRC validation can only be done if backData and backLen are specified.
 *
 * @return STATUS_OK on success, STATUS_??? otherwise.
 */
MFRC522::StatusCode MFRC522::PCD_CommunicateWithPICC( byte command,	///< The command to execute. One of the PCD_Command enums.
		byte waitIRq,///< The bits in the ComIrqReg register that signals successful completion of the command.
		byte *sendData,		///< Pointer to the data to transfer to the FIFO.
		byte sendLen,		///< Number of bytes to transfer to the FIFO.
		byte *backData,	///< nullptr or pointer to buffer if data should be read back after executing the command.
		byte *backLen,///< In: Max number of bytes to write to *backData. Out: The number of bytes returned.
		byte *validBits,///< In/Out: The number of valid bits in the last byte. 0 for 8 valid bits.
		byte rxAlign,///< In: Defines the bit position in backData[0] for the first bit received. Default 0.
		bool checkCRC///< In: True => The last two bytes of the response is assumed to be a CRC_A that must be validated.
		)
{
	// Prepare values for BitFramingReg
	byte txLastBits = validBits ? *validBits : 0;
	byte bitFraming = (rxAlign << 4) + txLastBits;// RxAlign = BitFramingReg[6..4]. TxLastBits = BitFramingReg[2..0]

	PCD_WriteRegister(CommandReg, PCD_Idle);		// Stop any active command.
	PCD_WriteRegister(ComIrqReg, 0x7F);	// Clear all seven interrupt request bits
	PCD_WriteRegister(FIFOLevelReg, 0x80);// FlushBuffer = 1, FIFO initialization
	PCD_WriteRegister(FIFODataReg, sendLen, sendData);// Write sendData to the FIFO
	PCD_WriteRegister(BitFramingReg, bitFraming);		// Bit adjustments
	PCD_WriteRegister(CommandReg, command);				// Execute the command
	if (command == PCD_Transceive)
	{
		PCD_SetRegisterBitMask(BitFramingReg, 0x80);// StartSend=1, transmission of data starts
	}

	// Wait for the command to complete.
	// In PCD_Init() we set the TAuto flag in TModeReg. This means the timer automatically starts when the PCD stops transmitting.
	// Each iteration of the do-while-loop takes 17.86μs.
	// TODO check/modify for other architectures than Arduino Uno 16bit
#if defined __ARDUINO__
	uint16_t i;
	for (i = 2000; i > 0; i--)
	{
		byte n = PCD_ReadRegister(ComIrqReg);// ComIrqReg[7..0] bits are: Set1 TxIRq RxIRq IdleIRq HiAlertIRq LoAlertIRq ErrIRq TimerIRq
		if (n & waitIRq)
		{			// One of the interrupts that signal success has been set.
			break;
		}
		if (n & 0x01)
		{						// Timer interrupt - nothing received in 25ms
			return STATUS_TIMEOUT;
		}
	}
	// 35.7ms and nothing happend. Communication with the MFRC522 might be down.
		if (i == 0)
		{
			return STATUS_TIMEOUT;
		}
#elif defined __STM32__
	uint32_t timeout = HAL_GetTick();
	switch (HAL_GetTickFreq())
	{
	case HAL_TICK_FREQ_10HZ:
		timeout += 1000;
		break;
	case HAL_TICK_FREQ_100HZ:
		timeout += 1000;
		break;
	case HAL_TICK_FREQ_1KHZ:
		timeout += 1000;
		break;
	}
	do
	{
		uint8_t n = PCD_ReadRegister(ComIrqReg);
#if (DEBUG == 1)
		volatile uint8_t errReg = PCD_ReadRegister(ErrorReg);
		volatile uint8_t fifoLvlReg = PCD_ReadRegister(FIFOLevelReg);
		volatile uint8_t controlReg = PCD_ReadRegister(ControlReg);
		volatile uint8_t status1Reg = PCD_ReadRegister(Status1Reg);
		volatile uint8_t status2Reg = PCD_ReadRegister(Status2Reg);
		volatile uint8_t commandReg = PCD_ReadRegister(CommandReg);
#endif
		if (n & waitIRq)
		{			// One of the interrupts that signal success has been set.
			break;
		}
		if (n & 0x01)
		{						// Timer interrupt - nothing received in 25ms
			return STATUS_TIMEOUT;
		}
	} while ((timeout = (timeout >= HAL_GetTick()) ? timeout : 0));
	if (!timeout)
		return STATUS_TIMEOUT;
#endif
// Stop now if any errors except collisions were detected.
	byte errorRegValue = PCD_ReadRegister(ErrorReg); // ErrorReg[7..0] bits are: WrErr TempErr reserved BufferOvfl CollErr CRCErr ParityErr ProtocolErr
	if (errorRegValue & 0x13)
	{	 // BufferOvfl ParityErr ProtocolErr
		return STATUS_ERROR;
	}

	byte _validBits = 0;

// If the caller wants data back, get it from the MFRC522.
	if (backData && backLen)
	{
		byte n = PCD_ReadRegister(FIFOLevelReg);// Number of bytes in the FIFO
		if (n > *backLen)
		{
			return STATUS_NO_ROOM;
		}
		*backLen = n;								// Number of bytes returned
		PCD_ReadRegister(FIFODataReg, n, backData, rxAlign);// Get received data from FIFO
		_validBits = PCD_ReadRegister(ControlReg) & 0x07;// RxLastBits[2:0] indicates the number of valid bits in the last received byte. If this value is 000b, the whole byte is valid.
		if (validBits)
		{
			*validBits = _validBits;
		}
	}

// Tell about collisions
	if (errorRegValue & 0x08)
	{		// CollErr
		return STATUS_COLLISION;
	}

// Perform CRC_A validation if requested.
	if (backData && backLen && checkCRC)
	{
		// In this case a MIFARE Classic NAK is not OK.
		if (*backLen == 1 && _validBits == 4)
		{
			return STATUS_MIFARE_NACK;
		}
		// We need at least the CRC_A value and all 8 bits of the last byte must be received.
		if (*backLen < 2 || _validBits != 0)
		{
			return STATUS_CRC_WRONG;
		}
		// Verify CRC_A - do our own calculation and store the control in controlBuffer.
		byte controlBuffer[2];
		MFRC522::StatusCode status = PCD_CalculateCRC(&backData[0],
				*backLen - 2, &controlBuffer[0]);
		if (status != STATUS_OK)
		{
			return status;
		}
		if ((backData[*backLen - 2] != controlBuffer[0])
				|| (backData[*backLen - 1] != controlBuffer[1]))
		{
			return STATUS_CRC_WRONG;
		}
	}

	return STATUS_OK;
} // End PCD_CommunicateWithPICC()

/**
 * Transmits a REQuest command, Type A. Invites PICCs in state IDLE to go to READY and prepare for anticollision or selection. 7 bit frame.
 * Beware: When two PICCs are in the field at the same time I often get STATUS_TIMEOUT - probably due do bad antenna design.
 * 
 * @return STATUS_OK on success, STATUS_??? otherwise.
 */
MFRC522::StatusCode MFRC522::PICC_RequestA( byte *bufferATQA, ///< The buffer to store the ATQA (Answer to request) in
		byte *bufferSize ///< Buffer size, at least two bytes. Also number of bytes returned if STATUS_OK.
		)
{
	return PICC_REQA_or_WUPA(PICC_CMD_REQA, bufferATQA, bufferSize);
} // End PICC_RequestA()

/**
 * Transmits a Wake-UP command, Type A. Invites PICCs in state IDLE and HALT to go to READY(*) and prepare for anticollision or selection. 7 bit frame.
 * Beware: When two PICCs are in the field at the same time I often get STATUS_TIMEOUT - probably due do bad antenna design.
 * 
 * @return STATUS_OK on success, STATUS_??? otherwise.
 */
MFRC522::StatusCode MFRC522::PICC_WakeupA( byte *bufferATQA, ///< The buffer to store the ATQA (Answer to request) in
		byte *bufferSize ///< Buffer size, at least two bytes. Also number of bytes returned if STATUS_OK.
		)
{
	return PICC_REQA_or_WUPA(PICC_CMD_WUPA, bufferATQA, bufferSize);
} // End PICC_WakeupA()

/**
 * Transmits REQA or WUPA commands.
 * Beware: When two PICCs are in the field at the same time I often get STATUS_TIMEOUT - probably due do bad antenna design.
 * 
 * @return STATUS_OK on success, STATUS_??? otherwise.
 */
MFRC522::StatusCode MFRC522::PICC_REQA_or_WUPA( byte command, ///< The command to send - PICC_CMD_REQA or PICC_CMD_WUPA
		byte *bufferATQA, ///< The buffer to store the ATQA (Answer to request) in
		byte *bufferSize ///< Buffer size, at least two bytes. Also number of bytes returned if STATUS_OK.
		)
{
	byte validBits;
	MFRC522::StatusCode status;

