Kom46/MFRC522_STM32/MFRC522.cpp
// Translate the int32_t into 4 bytes; repeated 2x in value block
	buffer[0] = buffer[8] = (value & 0xFF);
	buffer[1] = buffer[9] = (value & 0xFF00) >> 8;
	buffer[2] = buffer[10] = (value & 0xFF0000) >> 16;
	buffer[3] = buffer[11] = (value & 0xFF000000) >> 24;
// Inverse 4 bytes also found in value block
	buffer[4] = ~buffer[0];
	buffer[5] = ~buffer[1];
	buffer[6] = ~buffer[2];
	buffer[7] = ~buffer[3];
// Address 2x with inverse address 2x
	buffer[12] = buffer[14] = blockAddr;
	buffer[13] = buffer[15] = ~blockAddr;

// Write the whole data block
	return MIFARE_Write(blockAddr, buffer, 16);
} // End MIFARE_SetValue()

/**
 * Authenticate with a NTAG216.
 * 
 * Only for NTAG216. First implemented by Gargantuanman.
 * 
 * @param[in]   passWord   password.
 * @param[in]   pACK       result success???.
 * @return STATUS_OK on success, STATUS_??? otherwise.
 */
MFRC522::StatusCode MFRC522::PCD_NTAG216_AUTH(byte *passWord, byte pACK[]) //Authenticate with 32bit password
{
// TODO: Fix cmdBuffer length and rxlength. They really should match.
//       (Better still, rxlength should not even be necessary.)

	MFRC522::StatusCode result;
	byte cmdBuffer[18]; // We need room for 16 bytes data and 2 bytes CRC_A.

	cmdBuffer[0] = 0x1B; //Comando de autentificacion

	for (byte i = 0; i < 4; i++)
		cmdBuffer[i + 1] = passWord[i];

	result = PCD_CalculateCRC(cmdBuffer, 5, &cmdBuffer[5]);

	if (result != STATUS_OK)
	{
		return result;
	}

// Transceive the data, store the reply in cmdBuffer[]
	byte waitIRq = 0x30;	// RxIRq and IdleIRq
//	byte cmdBufferSize	= sizeof(cmdBuffer);
	byte validBits = 0;
	byte rxlength = 5;
	result = PCD_CommunicateWithPICC(PCD_Transceive, waitIRq, cmdBuffer, 7,
			cmdBuffer, &rxlength, &validBits);

	pACK[0] = cmdBuffer[0];
	pACK[1] = cmdBuffer[1];

	if (result != STATUS_OK)
	{
		return result;
	}

	return STATUS_OK;
} // End PCD_NTAG216_AUTH()

/////////////////////////////////////////////////////////////////////////////////////
// Support functions
/////////////////////////////////////////////////////////////////////////////////////

/**
 * Wrapper for MIFARE protocol communication.
 * Adds CRC_A, executes the Transceive command and checks that the response is MF_ACK or a timeout.
 * 
 * @return STATUS_OK on success, STATUS_??? otherwise.
 */
MFRC522::StatusCode MFRC522::PCD_MIFARE_Transceive( byte *sendData,	///< Pointer to the data to transfer to the FIFO. Do NOT include the CRC_A.
		byte sendLen,		///< Number of bytes in sendData.
		bool acceptTimeout	///< True => A timeout is also success
		)
{
	MFRC522::StatusCode result;
	byte cmdBuffer[18]; // We need room for 16 bytes data and 2 bytes CRC_A.

// Sanity check
	if (sendData == nullptr || sendLen > 16)
	{
		return STATUS_INVALID;
	}

// Copy sendData[] to cmdBuffer[] and add CRC_A
	memcpy(cmdBuffer, sendData, sendLen);
	result = PCD_CalculateCRC(cmdBuffer, sendLen, &cmdBuffer[sendLen]);
	if (result != STATUS_OK)
	{
		return result;
	}
	sendLen += 2;

// Transceive the data, store the reply in cmdBuffer[]
	byte waitIRq = 0x30;		// RxIRq and IdleIRq
	byte cmdBufferSize = sizeof(cmdBuffer);
	byte validBits = 0;
	result = PCD_CommunicateWithPICC(PCD_Transceive, waitIRq, cmdBuffer,
			sendLen, cmdBuffer, &cmdBufferSize, &validBits);
	if (acceptTimeout && result == STATUS_TIMEOUT)
	{
		return STATUS_OK;
	}
	if (result != STATUS_OK)
	{
		return result;
	}
// The PICC must reply with a 4 bit ACK
	if (cmdBufferSize != 1 || validBits != 4)
	{
		return STATUS_ERROR;
	}
	if (cmdBuffer[0] != MF_ACK)
	{
		return STATUS_MIFARE_NACK;
	}
	return STATUS_OK;
} // End PCD_MIFARE_Transceive()

/**
 * Returns a __FlashStringHelper pointer to a status code name.
 * 
 * @return const __FlashStringHelper *
 */
const
#if defined __ARDUINO__
__FlashStringHelper
#else
char
#endif
* MFRC522::GetStatusCodeName(MFRC522::StatusCode code ///< One of the StatusCode enums.
		)
{
#if defined __ARDUINO__
	switch (code)
	{
	case STATUS_OK:
		return F("Success.");
	case STATUS_ERROR:
		return F("Error in communication.");
	case STATUS_COLLISION:
		return F("Collission detected.");
	case STATUS_TIMEOUT:
		return F("Timeout in communication.");
	case STATUS_NO_ROOM:
		return F("A buffer is not big enough.");
	case STATUS_INTERNAL_ERROR:
		return F("Internal error in the code. Should not happen.");
	case STATUS_INVALID:
		return F("Invalid argument.");
	case STATUS_CRC_WRONG:
		return F("The CRC_A does not match.");
	case STATUS_MIFARE_NACK:
		return F("A MIFARE PICC responded with NAK.");
	default:
		return F("Unknown error");
	}
#endif
	switch (code)
	{
	case STATUS_OK:
		return "Success.";
	case STATUS_ERROR:
		return "Error in communication.";
	case STATUS_COLLISION:
		return "Collission detected.";
	case STATUS_TIMEOUT:
		return "Timeout in communication.";
	case STATUS_NO_ROOM:
		return "A buffer is not big enough.";
	case STATUS_INTERNAL_ERROR:
		return "Internal error in the code. Should not happen.";
	case STATUS_INVALID:
		return "Invalid argument.";
	case STATUS_CRC_WRONG:
		return "The CRC_A does not match.";
	case STATUS_MIFARE_NACK:
		return "A MIFARE PICC responded with NAK.";
	default:
		return "Unknown error";
	}
} // End GetStatusCodeName()

/**
 * Translates the SAK (Select Acknowledge) to a PICC type.
 * 
 * @return PICC_Type
 */
MFRC522::PICC_Type MFRC522::PICC_GetType(byte sak ///< The SAK byte returned from PICC_Select().
		)
{
// http://www.nxp.com/documents/application_note/AN10833.pdf
// 3.2 Coding of Select Acknowledge (SAK)
// ignore 8-bit (iso14443 starts with LSBit = bit 1)
// fixes wrong type for manufacturer Infineon (http://nfc-tools.org/index.php?title=ISO14443A)
	sak &= 0x7F;
	switch (sak)
	{
	case 0x04:
		return PICC_TYPE_NOT_COMPLETE;	// UID not complete
	case 0x09:
		return PICC_TYPE_MIFARE_MINI;
	case 0x08:
		return PICC_TYPE_MIFARE_1K;
	case 0x18:
		return PICC_TYPE_MIFARE_4K;
	case 0x00:
		return PICC_TYPE_MIFARE_UL;
	case 0x10:
	case 0x11:
		return PICC_TYPE_MIFARE_PLUS;
	case 0x01:
		return PICC_TYPE_TNP3XXX;
	case 0x20:
		return PICC_TYPE_ISO_14443_4;
	case 0x40:
		return PICC_TYPE_ISO_18092;
	default:
		return PICC_TYPE_UNKNOWN;
	}
} // End PICC_GetType()

/**
 * Returns a __FlashStringHelper pointer to the PICC type name.
 * 
 * @return const __FlashStringHelper *
 */
const
#if defined __ARDUINO__
__FlashStringHelper
#else
char
#endif
* MFRC522::PICC_GetTypeName(PICC_Type piccType ///< One of the PICC_Type enums.
		)
{
#if defined __ARDUINO__
	switch (piccType)
	{
	case PICC_TYPE_ISO_14443_4:
		return F("PICC compliant with ISO/IEC 14443-4");
	case PICC_TYPE_ISO_18092:
		return F("PICC compliant with ISO/IEC 18092 (NFC)");
	case PICC_TYPE_MIFARE_MINI:
		return F("MIFARE Mini, 320 bytes");
	case PICC_TYPE_MIFARE_1K:
		return F("MIFARE 1KB");
	case PICC_TYPE_MIFARE_4K:
		return F("MIFARE 4KB");
	case PICC_TYPE_MIFARE_UL:
		return F("MIFARE Ultralight or Ultralight C");
	case PICC_TYPE_MIFARE_PLUS:
		return F("MIFARE Plus");
	case PICC_TYPE_MIFARE_DESFIRE:
		return F("MIFARE DESFire");
	case PICC_TYPE_TNP3XXX:
		return F("MIFARE TNP3XXX");
	case PICC_TYPE_NOT_COMPLETE:
		return F("SAK indicates UID is not complete.");
	case PICC_TYPE_UNKNOWN:
	default:
		return F("Unknown type");
	}
#else
	switch (piccType)
	{
	case PICC_TYPE_ISO_14443_4:
		return "PICC compliant with ISO/IEC 14443-4";
	case PICC_TYPE_ISO_18092:
		return "PICC compliant with ISO/IEC 18092 (NFC)";
	case PICC_TYPE_MIFARE_MINI:
		return "MIFARE Mini, 320 bytes";
	case PICC_TYPE_MIFARE_1K:
		return "MIFARE 1KB";
	case PICC_TYPE_MIFARE_4K:
		return "MIFARE 4KB";
	case PICC_TYPE_MIFARE_UL:
		return "MIFARE Ultralight or Ultralight C";
	case PICC_TYPE_MIFARE_PLUS:
		return "MIFARE Plus";
	case PICC_TYPE_MIFARE_DESFIRE:
		return "MIFARE DESFire";
	case PICC_TYPE_TNP3XXX:
		return "MIFARE TNP3XXX";
	case PICC_TYPE_NOT_COMPLETE:
		return "SAK indicates UID is not complete.";
	case PICC_TYPE_UNKNOWN:
	default:
		return "Unknown type";
	}
#endif
} // End PICC_GetTypeName()

/**
 * Dumps debug info about the connected PCD to Serial.
 * Shows all known firmware versions
 */
void MFRC522::PCD_DumpVersionToSerial()
{
// Get the MFRC522 firmware version
	byte v = PCD_ReadRegister(VersionReg);
#if defined __ARDUINO__
	Serial.print(F("Firmware Version: 0x"));
	Serial.print(v, HEX);
	// Lookup which version
	switch (v)
	{
	case 0x88:
		Serial.println(F(" = (clone)"));
		break;
	case 0x90:
		Serial.println(F(" = v0.0"));
		break;
	case 0x91:
		Serial.println(F(" = v1.0"));
		break;
	case 0x92:
		Serial.println(F(" = v2.0"));
		break;
	case 0x12:
		Serial.println(F(" = counterfeit chip"));
		break;
	default:
		Serial.println(F(" = (unknown)"));
	}
	// When 0x00 or 0xFF is returned, communication probably failed
	if ((v == 0x00) || (v == 0xFF))
		Serial.println(
				F(
						"WARNING: Communication failure, is the MFRC522 properly connected?"));
#endif
} // End PCD_DumpVersionToSerial()

/**
 * Dumps debug info about the selected PICC to Serial.
 * On success the PICC is halted after dumping the data.
 * For MIFARE Classic the factory default key of 0xFFFFFFFFFFFF is tried.  
 */
void MFRC522::PICC_DumpToSerial(Uid *uid ///< Pointer to Uid struct returned from a successful PICC_Select().
		)
{
	MIFARE_Key key;

