Kom46/MFRC522_STM32/MFRC522.cpp
		// Which access group is this block in?
		if (no_of_blocks == 4)
		{
			group = blockOffset;
			firstInGroup = true;
		}
		else
		{
			group = blockOffset / 5;
			firstInGroup = (group == 3) || (group != (blockOffset + 1) / 5);
		}

		if (firstInGroup)
		{
			// Print access bits
			Serial.print(F(" [ "));
			Serial.print((g[group] >> 2) & 1, DEC);
			Serial.print(F(" "));
			Serial.print((g[group] >> 1) & 1, DEC);
			Serial.print(F(" "));
			Serial.print((g[group] >> 0) & 1, DEC);
			Serial.print(F(" ] "));
			if (invertedError)
			{
				Serial.print(F(" Inverted access bits did not match! "));
			}
		}

		if (group != 3 && (g[group] == 1 || g[group] == 6))
		{ // Not a sector trailer, a value block
			int32_t value = (int32_t(buffer[3]) << 24)
					| (int32_t(buffer[2]) << 16) | (int32_t(buffer[1]) << 8)
					| int32_t(buffer[0]);
			Serial.print(F(" Value=0x"));
			Serial.print(value, HEX);
			Serial.print(F(" Adr=0x"));
			Serial.print(buffer[12], HEX);
		}
		Serial.println();
	}
#endif
	return;
} // End PICC_DumpMifareClassicSectorToSerial()

/**
 * Dumps memory contents of a MIFARE Ultralight PICC.
 */
void MFRC522::PICC_DumpMifareUltralightToSerial()
{
	MFRC522::StatusCode status;
	byte byteCount;
	byte buffer[18];
	byte i;
#if defined __ARDUINO__
	Serial.println(F("Page  0  1  2  3"));
	// Try the mpages of the original Ultralight. Ultralight C has more pages.
	for (byte page = 0; page < 16; page += 4)
	{ // Read returns data for 4 pages at a time.
	  // Read pages
		byteCount = sizeof(buffer);
		status = MIFARE_Read(page, buffer, &byteCount);
		if (status != STATUS_OK)
		{
			Serial.print(F("MIFARE_Read() failed: "));
			Serial.println(GetStatusCodeName(status));
			break;
		}
		// Dump data
		for (byte offset = 0; offset < 4; offset++)
		{
			i = page + offset;
			if (i < 10)
				Serial.print(F("  ")); // Pad with spaces
			else
				Serial.print(F(" ")); // Pad with spaces
			Serial.print(i);
			Serial.print(F("  "));
			for (byte index = 0; index < 4; index++)
			{
				i = 4 * offset + index;
				if (buffer[i] < 0x10)
					Serial.print(F(" 0"));
				else
					Serial.print(F(" "));
				Serial.print(buffer[i], HEX);
			}
			Serial.println();
		}
	}
#endif
} // End PICC_DumpMifareUltralightToSerial()

/**
 * Calculates the bit pattern needed for the specified access bits. In the [C1 C2 C3] tuples C1 is MSB (=4) and C3 is LSB (=1).
 */
void MFRC522::MIFARE_SetAccessBits( byte *accessBitBuffer, ///< Pointer to byte 6, 7 and 8 in the sector trailer. Bytes [0..2] will be set.
		byte g0, ///< Access bits [C1 C2 C3] for block 0 (for sectors 0-31) or blocks 0-4 (for sectors 32-39)
		byte g1, ///< Access bits C1 C2 C3] for block 1 (for sectors 0-31) or blocks 5-9 (for sectors 32-39)
		byte g2, ///< Access bits C1 C2 C3] for block 2 (for sectors 0-31) or blocks 10-14 (for sectors 32-39)
		byte g3	///< Access bits C1 C2 C3] for the sector trailer, block 3 (for sectors 0-31) or block 15 (for sectors 32-39)
		)
{
	byte c1 = ((g3 & 4) << 1) | ((g2 & 4) << 0) | ((g1 & 4) >> 1)
			| ((g0 & 4) >> 2);
	byte c2 = ((g3 & 2) << 2) | ((g2 & 2) << 1) | ((g1 & 2) << 0)
			| ((g0 & 2) >> 1);
	byte c3 = ((g3 & 1) << 3) | ((g2 & 1) << 2) | ((g1 & 1) << 1)
			| ((g0 & 1) << 0);

	accessBitBuffer[0] = (~c2 & 0xF) << 4 | (~c1 & 0xF);
	accessBitBuffer[1] = c1 << 4 | (~c3 & 0xF);
	accessBitBuffer[2] = c3 << 4 | c2;
} // End MIFARE_SetAccessBits()

/**
 * Performs the "magic sequence" needed to get Chinese UID changeable
 * Mifare cards to allow writing to sector 0, where the card UID is stored.
 *
 * Note that you do not need to have selected the card through REQA or WUPA,
 * this sequence works immediately when the card is in the reader vicinity.
 * This means you can use this method even on "bricked" cards that your reader does
 * not recognise anymore (see MFRC522::MIFARE_UnbrickUidSector).
 * 
 * Of course with non-bricked devices, you're free to select them before calling this function.
 */
bool MFRC522::MIFARE_OpenUidBackdoor(bool logErrors)
{
// Magic sequence:
// > 50 00 57 CD (HALT + CRC)
// > 40 (7 bits only)
// < A (4 bits only)
// > 43
// < A (4 bits only)
// Then you can write to sector 0 without authenticating

	PICC_HaltA(); // 50 00 57 CD

	byte cmd = 0x40;
	byte validBits = 7; /* Our command is only 7 bits. After receiving card response,
	 this will contain amount of valid response bits. */
	byte response[32]; // Card's response is written here
	byte received;
	MFRC522::StatusCode status = PCD_TransceiveData(&cmd, (byte) 1, response,
			&received, &validBits, (byte) 0, false); // 40
	if (status != STATUS_OK)
	{
		if (logErrors)
		{
#if defined __ARDUINO__
			Serial.println(
					F(
							"Card did not respond to 0x40 after HALT command. Are you sure it is a UID changeable one?"));
			Serial.print(F("Error name: "));
			Serial.println(GetStatusCodeName(status));
#endif
		}
		return false;
	}
	if (received != 1 || response[0] != 0x0A)
	{
		if (logErrors)
		{
#if defined __ARDUINO__
			Serial.print(F("Got bad response on backdoor 0x40 command: "));
			Serial.print(response[0], HEX);
			Serial.print(F(" ("));
			Serial.print(validBits);
			Serial.print(F(" valid bits)\r\n"));
#endif
		}
		return false;
	}

	cmd = 0x43;
	validBits = 8;
	status = PCD_TransceiveData(&cmd, (byte) 1, response, &received, &validBits,
			(byte) 0, false); // 43
	if (status != STATUS_OK)
	{
		if (logErrors)
		{
#if defined __ARDUINO__
			Serial.println(
					F(
							"Error in communication at command 0x43, after successfully executing 0x40"));
			Serial.print(F("Error name: "));
			Serial.println(GetStatusCodeName(status));
#endif
		}
		return false;
	}
	if (received != 1 || response[0] != 0x0A)
	{
		if (logErrors)
		{
#if defined __ARDUINO__
			Serial.print(F("Got bad response on backdoor 0x43 command: "));
			Serial.print(response[0], HEX);
			Serial.print(F(" ("));
			Serial.print(validBits);
			Serial.print(F(" valid bits)\r\n"));
#endif
		}
		return false;
	}

// You can now write to sector 0 without authenticating!
	return true;
} // End MIFARE_OpenUidBackdoor()

/**
 * Reads entire block 0, including all manufacturer data, and overwrites
 * that block with the new UID, a freshly calculated BCC, and the original
 * manufacturer data.
 *
 * It assumes a default KEY A of 0xFFFFFFFFFFFF.
 * Make sure to have selected the card before this function is called.
 */
bool MFRC522::MIFARE_SetUid(byte *newUid, byte uidSize, bool logErrors)
{

// UID + BCC byte can not be larger than 16 together
	if (!newUid || !uidSize || uidSize > 15)
	{
		if (logErrors)
		{
#if defined __ARDUINO__
			Serial.println(
					F("New UID buffer empty, size 0, or size > 15 given"));
#endif
		}
		return false;
	}

// Authenticate for reading
	MIFARE_Key key =
	{ 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF };
	MFRC522::StatusCode status = PCD_Authenticate(
			MFRC522::PICC_CMD_MF_AUTH_KEY_A, (byte) 1, &key, &uid);
	if (status != STATUS_OK)
	{

		if (status == STATUS_TIMEOUT)
		{
			// We get a read timeout if no card is selected yet, so let's select one

