Kom46/MFRC522_STM32/MFRC522.cpp
			// Wake the card up again if sleeping
//			  byte atqa_answer[2];
//			  byte atqa_size = 2;
//			  PICC_WakeupA(atqa_answer, &atqa_size);

			if (!PICC_IsNewCardPresent() || !PICC_ReadCardSerial())
			{
#if defined __ARDUINO__
				Serial.println(
						F(
								"No card was previously selected, and none are available. Failed to set UID."));
#endif
				return false;
			}

			status = PCD_Authenticate(MFRC522::PICC_CMD_MF_AUTH_KEY_A, (byte) 1,
					&key, &uid);
			if (status != STATUS_OK)
			{
				// We tried, time to give up
				if (logErrors)
				{
#if defined __ARDUINO__
					Serial.println(
							F(
									"Failed to authenticate to card for reading, could not set UID: "));
					Serial.println(GetStatusCodeName(status));
#endif
				}
				return false;
			}
		}
		else
		{
			if (logErrors)
			{
#if defined __ARDUINO__
				Serial.print(F("PCD_Authenticate() failed: "));
				Serial.println(GetStatusCodeName(status));
#endif
			}
			return false;
		}
	}

// Read block 0
	byte block0_buffer[18];
	byte byteCount = sizeof(block0_buffer);
	status = MIFARE_Read((byte) 0, block0_buffer, &byteCount);
	if (status != STATUS_OK)
	{
		if (logErrors)
		{
#if defined __ARDUINO__
			Serial.print(F("MIFARE_Read() failed: "));
			Serial.println(GetStatusCodeName(status));
			Serial.println(
					F(
							"Are you sure your KEY A for sector 0 is 0xFFFFFFFFFFFF?"));
#endif
		}
		return false;
	}

// Write new UID to the data we just read, and calculate BCC byte
	byte bcc = 0;
	for (uint8_t i = 0; i < uidSize; i++)
	{
		block0_buffer[i] = newUid[i];
		bcc ^= newUid[i];
	}

// Write BCC byte to buffer
	block0_buffer[uidSize] = bcc;

// Stop encrypted traffic so we can send raw bytes
	PCD_StopCrypto1();

// Activate UID backdoor
	if (!MIFARE_OpenUidBackdoor(logErrors))
	{
		if (logErrors)
		{
#if defined __ARDUINO__
			Serial.println(F("Activating the UID backdoor failed."));
#endif
		}
		return false;
	}

// Write modified block 0 back to card
	status = MIFARE_Write((byte) 0, block0_buffer, (byte) 16);
	if (status != STATUS_OK)
	{
		if (logErrors)
		{
#if defined __ARDUINO__
			Serial.print(F("MIFARE_Write() failed: "));
			Serial.println(GetStatusCodeName(status));
#endif
		}
		return false;
	}

// Wake the card up again
	byte atqa_answer[2];
	byte atqa_size = 2;
	PICC_WakeupA(atqa_answer, &atqa_size);

	return true;
}

/**
 * Resets entire sector 0 to zeroes, so the card can be read again by readers.
 */
bool MFRC522::MIFARE_UnbrickUidSector(bool logErrors)
{
	MIFARE_OpenUidBackdoor(logErrors);

	byte block0_buffer[] =
	{ 0x01, 0x02, 0x03, 0x04, 0x04, 0x08, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00,
			0x00, 0x00, 0x00, 0x00 };

// Write modified block 0 back to card
	MFRC522::StatusCode status = MIFARE_Write((byte) 0, block0_buffer,
			(byte) 16);
	if (status != STATUS_OK)
	{
		if (logErrors)
		{
#if defined __ARDUINO__
			Serial.print(F("MIFARE_Write() failed: "));
			Serial.println(GetStatusCodeName(status));
#endif
		}
		return false;
	}
	return true;
}

/////////////////////////////////////////////////////////////////////////////////////
// Convenience functions - does not add extra functionality
/////////////////////////////////////////////////////////////////////////////////////

/**
 * Returns true if a PICC responds to PICC_CMD_REQA.
 * Only "new" cards in state IDLE are invited. Sleeping cards in state HALT are ignored.
 * 
 * @return bool
 */
bool MFRC522::PICC_IsNewCardPresent()
{
	byte bufferATQA[2];
	byte bufferSize = sizeof(bufferATQA);

// Reset baud rates
	PCD_WriteRegister(TxModeReg, 0x00);
	PCD_WriteRegister(RxModeReg, 0x00);
// Reset ModWidthReg
	PCD_WriteRegister(ModWidthReg, 0x26);

	MFRC522::StatusCode result = PICC_RequestA(bufferATQA, &bufferSize);
	return (result == STATUS_OK || result == STATUS_COLLISION);
} // End PICC_IsNewCardPresent()

/**
 * Simple wrapper around PICC_Select.
 * Returns true if a UID could be read.
 * Remember to call PICC_IsNewCardPresent(), PICC_RequestA() or PICC_WakeupA() first.
 * The read UID is available in the class variable uid.
 * 
 * @return bool
 */
bool MFRC522::PICC_ReadCardSerial()
{
	MFRC522::StatusCode result = PICC_Select(&uid);
	return (result == STATUS_OK);
} // End 
